app/services/course_service.rb

  def self.create_or_find_course(course_data)
    Course.find_or_create_by(
      term: course_data['term'],
      title: course_data['title'],
      description: course_data['description'],
      subject: course_data['subject'],
      catalog_number: course_data['catalogNumber'],
      campus: course_data['campus'],
      course_id: course_data['courseId']
    )
---
INSERT INTO "courses" ("term", "title", "description", "subject", "catalog_number", "campus", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "courses".* FROM "courses" WHERE "courses"."term" = ? AND "courses"."title" = ? AND "courses"."description" = ? AND "courses"."subject" = ? AND "courses"."catalog_number" = ? AND "courses"."campus" = ? AND "courses"."course_id" = ? LIMIT ?

  def self.create_sections(course_id, sections_data)
    sections_data.each do |section_data|
      meeting_data = section_data['meetings'].first
      section_attributes = {
        section_number: section_data['classNumber'].to_i,
        component: section_data['component'],
        instruction_mode: section_data['instructionMode'],
        building_description: meeting_data['buildingDescription'],
        start_time: meeting_data['startTime'],
        end_time: meeting_data['endTime'],
        start_date: section_data['startDate'],
        end_date: section_data['endDate'],
        monday: false,
        tuesday: false,
        wednesday: false,
        thursday: false,
        friday: false,
        saturday: false,
        sunday: false,
        required_graders: 1,
        course_id: course_id
      }

      section_data['meetings'].each do |meeting|
        %w[monday tuesday wednesday thursday friday saturday sunday].each do |day|
          section_attributes[day] ||= meeting[day]
        end
      end

      Section.create(section_attributes)
---
INSERT INTO "sections" ("section_number", "component", "instruction_mode", "building_description", "start_time", "end_time", "start_date", "end_date", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday", "course_id", "created_at", "updated_at", "required_graders") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"