app/controllers/admins_controller.rb

  def dashboard
    @unverified_users = User.unverified
    @unverified_users = @unverified_users.with_email(params[:search_email]) if params[:search_email].present?
---
SELECT "users".* FROM "users" WHERE "users"."verified" = ?  [["verified", 0]]