app/controllers/recommendations_controller.rb

  def index
    @recommendations = Recommendation.all
---
SELECT "recommendations".* FROM "recommendations"

  def new
    @recommendation = Recommendation.new(prof_email: current_user.email)
    @courses = Course.order(title: :asc)
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."title" ASC