app/controllers/student_applications_controller.rb

SELECT "courses".* FROM "courses" ORDER BY "courses"."title" ASC
---
  def new
    @student_application = StudentApplication.new
    @courses = Course.order(title: :asc)